controllers/ProductsController.php

SELECT * FROM `products` WHERE `id`='203'
---
    protected function findModel($id)
    {
        if (($model = Products::findOne($id)) !== null) {