views/site/slider.php

use yii\helpers\Html;
use app\models\Products;

$products = Products::find()->orderBy(['views' => SORT_DESC])->limit(7)->all();
---
SELECT * FROM `products` ORDER BY `views` DESC LIMIT 7