views/products/_search.php


    <div class="row">
        <div class="col-sm-4">
            <?= $form->field($model, 'manufacturer')->widget(Select2::className(), [
                'data' => ArrayHelper::map(Products::find()->groupBy('manufacturer')->all(), 'manufacturer', 'manufacturer'),
                'pluginOptions' => [
                    'placeholder' => Yii::t('app', 'Manufacturer'),
                    'allowClear' => true
                ]
            ])->label(false) ?>
---
SELECT * FROM `products` GROUP BY `manufacturer`