models/Categories.php

    static public function getCatItems(){
        $items = [];
        $cats = self::find()->where(['parent' => '0', 'visible' => '1'])->all();
---
SELECT * FROM `categories` WHERE (`parent`='0') AND (`visible`='1')

    private static function getRecursive($cat_id){
        $items = [];
        $cats = self::find()->where(['visible' => '1', 'parent' => $cat_id])->all();
---
SELECT * FROM `categories` WHERE (`visible`='1') AND (`parent`=37)