models/Products.php

    public function getPicCount(){
        return Pictures::find()->select('id')->where(['product_id' => $this->id])->count();
---
SELECT COUNT(*) FROM `pictures` WHERE `product_id`=294